Revit 2026 API

# CheckerTextureURepeat Property

---

The property labeled "U Repeat" from the "Checker" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TextureURepeat { get; }
```
```vb
Public Shared ReadOnly Property TextureURepeat As String
	Get
```
```cpp
public:
static property String^ TextureURepeat {
	String^ get ();
}
```
```fsharp
static member TextureURepeat : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

Checker Class

Autodesk.Revit.DB.Visual Namespace